#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Элементы.Найти("АбонентскаяПлата") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("АбонентскаяПлата", Тип("ПолеФормы"));
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Абонентская плата";
	КонецЕсли;
	
	ГруппаСумма = Элементы.Добавить("ГруппаСумма", Тип("ГруппаФормы"), ЭтотОбъект);
	ГруппаСумма.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСумма.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаСумма.ОтображатьЗаголовок = Ложь;
	ГруппаСумма.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	Если Элементы.Найти("СтоимостьЧасаРаботы") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), ГруппаСумма);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "СтоимостьЧасаРаботы";
	КонецЕсли;
	
	Если Элементы.Найти("Сумма") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("Сумма", Тип("ПолеФормы"), ГруппаСумма);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_Сумма";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Сумма";
	КонецЕсли;
	
	ГруппаПериод = Элементы.Добавить("ГруппаПериод", Тип("ГруппаФормы"), ЭтотОбъект);
	ГруппаПериод.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПериод.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаПериод.ОтображатьЗаголовок = Ложь;
	ГруппаПериод.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	Если Элементы.Найти("ДатаНачала") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("ДатаНачала", Тип("ПолеФормы"), ГруппаПериод);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаНачала";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Дата начала";
	КонецЕсли;
	
	Если Элементы.Найти("ДатаОкончания") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("ДатаОкончания", Тип("ПолеФормы"), ГруппаПериод);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончания";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Дата окончания";
	КонецЕсли;
	
	Элементы.ВидДоговора.УстановитьДействие("ПриИзменении", "ВидДоговораПриИзменении");
	ВывестиЭлементыНаФорму(ЭтотОбъект);
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВывестиЭлементыНаФорму(ЭтотОбъект);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиЭлементыНаФорму(Форма)
	
	Если Форма.Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		
		Форма.Элементы.АбонентскаяПлата.Видимость = Истина;
		Форма.Элементы.СтоимостьЧасаРаботы.Видимость = Истина;
		Форма.Элементы.Сумма.Видимость = Истина;
		Форма.Элементы.ДатаНачала.Видимость = Истина;
		Форма.Элементы.ДатаОкончания.Видимость = Истина;
		
	Иначе
		
		Форма.Элементы.АбонентскаяПлата.Видимость = Ложь;
		Форма.Элементы.СтоимостьЧасаРаботы.Видимость = Ложь;
		Форма.Элементы.Сумма.Видимость = Ложь;
		Форма.Элементы.ДатаНачала.Видимость = Ложь;
		Форма.Элементы.ДатаОкончания.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
