#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьСообщение() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТБ.Ссылка,
		|	ВКМ_УведомленияТБ.ТекстСообщения КАК text,
		|	ВКМ_ИдентификаторГруппыДляОповещения.Значение КАК chat_id,
		|	ВКМ_ТокенУправленияТБ.Значение КАК token_TB
		|ИЗ
		|	Справочник.ВКМ_УведомленияТБ КАК ВКМ_УведомленияТБ,
		|	Константа.ВКМ_ИдентификаторГруппыДляОповещения КАК ВКМ_ИдентификаторГруппыДляОповещения,
		|	Константа.ВКМ_ТокенУправленияТБ КАК ВКМ_ТокенУправленияТБ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Token_TB = Выборка.token_TB;
		Chat_id = Выборка.chat_id;
		ТекстСообщения = Выборка.text;
		
		АдресТБ = "api.telegram.org";
		Соединение = Новый HTTPСоединение(АдресТБ, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		
		Данные = Новый Структура();
		Данные.Вставить("text", ТекстСообщения);
		
		ЗаписьJSON = Новый ЗаписьJSON();
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, Данные);
		СтрокаJSON = ЗаписьJSON.Закрыть();
		
		Заголовки = Новый Соответствие();
		Заголовки.Вставить("Content-Type", "application/json");
		АдресЗапроса = "bot" + Token_TB + "/sendMessage?chat_id=" + Формат(Chat_id, "ЧГ=");
		
		ЗапросHTTP = Новый HTTPЗапрос(АдресЗапроса, Заголовки);
		ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаJSON);
		
		Попытка
			Результат = Соединение.ОтправитьДляОбработки(ЗапросHTTP);
			//Объект = Выборка.Ссылка.ПолучитьОбъект();
			//Объект.Удалить();
		Исключение
			ЗаписьЖурналаРегистрации("Выполнение операции", УровеньЖурналаРегистрации.Ошибка,,, 
			                         РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
		КонецПопытки;
		
		Соединение = Неопределено;
		ТелоОтвета = Результат.ПолучитьТелоКакСтроку();
		Если Результат.КодСостояния <> 200 Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = Результат.КодСостояния + "Проверка не выполнена " + ТелоОтвета;
 			Сообщение.Сообщить();
		Иначе 
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Объект.Удалить();
		КонецЕсли;
		
		Если Не Результат.КодСостояния = 200 Тогда
			ВызватьИсключение "Ошибка соединения";
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
