
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

//++Грунтова Диплом от 01.03.2025г.
Процедура ВыполнитьАвтозаполнение() Экспорт

	НоменклатураАбПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	НоменклатураРаботыСпец = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();  
	СуммаАбонентскойПлаты = Справочники.ДоговорыКонтрагентов.НайтиПоНаименованию(Договор);
	
	Отбор = Новый Структура();
	Отбор.Вставить("Договор", Договор);
		
	СуммаРаботКОплате = РегистрыНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(НачалоМесяца(Дата), КонецМесяца(Дата), 
	Отбор, "Договор", "СуммаКОплате,КоличествоЧасов");
	
		
		Если ЗначениеЗаполнено(НоменклатураАбПлата) Тогда
					
			НоваяСтрока = Услуги.Добавить();
			НоваяСтрока.Номенклатура = НоменклатураАбПлата.Ссылка;
			Если Тип("СправочникСсылка.ДоговорыКонтрагентов") = ТипЗнч(Справочники.ДоговорыКонтрагентов.ПустаяСсылка()) Тогда
				НоваяСтрока.Сумма = СуммаАбонентскойПлаты.ВКМ_Сумма;
			КонецЕсли;
				
		Иначе
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Не заполнена константа НоменклатураАбонентскаяПлата или сумма Абонентской платы в договоре";
			Сообщение.Сообщить();
			Услуги.Очистить();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НоменклатураРаботыСпец) Тогда
			
			Для Каждого Строка Из СуммаРаботКОплате  Цикл	
				
				Если ЗначениеЗаполнено(Строка.КоличествоЧасовПриход) Тогда
				
					НоваяСтрока = Услуги.Добавить();
					НоваяСтрока.Номенклатура = НоменклатураРаботыСпец.Ссылка;
				
					НоваяСтрока.Количество = Строка.КоличествоЧасовПриход;
					НоваяСтрока.Сумма = Строка.СуммаКОплатеПриход;
								
				КонецЕсли;
				
			КонецЦикла;					
		Иначе
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Не заполнена константа НоменклатураРаботыСпециалиста";
			Сообщение.Сообщить();
			Услуги.Очистить();				
		КонецЕсли;
		
КонецПроцедуры
//--Грунтова Диплом от 01.03.2025г.
#КонецОбласти

#КонецЕсли
