
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачалоПериода = НачалоНедели(ТекущаяДатаСеанса());
	КонецПериода = КонецНедели(ТекущаяДатаСеанса());
	
	Планировщик.ТекущиеПериодыОтображения.Добавить(НачалоПериода, КонецПериода);
	
	ОбновитьПланировщик();
	
	ОбслуживаниеКлиента = Документы.ВКМ_ОбслуживаниеКлиента.Выбрать(НачалоПериода, КонецПериода);
	
	Пока ОбслуживаниеКлиента.Следующий() Цикл
		
		ДатаРабот = Формат(ОбслуживаниеКлиента.ДатаПроведенияРабот, "ДФ=""ггггММдд""");
		ВремяНачало = Формат(ОбслуживаниеКлиента.ВремяНачалаРабот, "ДФ=""ЧЧммсс""");
		ВремяОкончания = Формат(ОбслуживаниеКлиента.ВремяОкончанияРабот, "ДФ=""ЧЧммсс""");
		
		НачалоРабот = Дата(ДатаРабот + ВремяНачало);
		ОкончаниеРабот = Дата(ДатаРабот + ВремяОкончания);
		
		ЭлементПланировщик = Планировщик.Элементы.Добавить(НачалоРабот, ОкончаниеРабот);
		ЭлементПланировщик.Значение = ОбслуживаниеКлиента.Ссылка;
		ЭлементПланировщик.Текст = ОбслуживаниеКлиента.Специалист;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ОбслуживаниеКлиента" Тогда
		ОбновитьПланировщик();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗначениеЗаполнения = Новый Структура;
	ЗначениеЗаполнения.Вставить("ВКМ_ДатаПроведенияРабот", Формат(Начало, "ДФ=""ддММгггг"""));
	ЗначениеЗаполнения.Вставить("ВКМ_ВремяНачалаРабот", Формат(Начало, "ДФ=""ЧЧммсс"""));
	ЗначениеЗаполнения.Вставить("ВКМ_ВремяОкончанияРабот", Формат(Конец, "ДФ=""ЧЧммсс"""));
	ЗначениеЗаполнения.Вставить("ВКМ_Специалист", Текст); 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначениеЗаполнения", ЗначениеЗаполнения); 
	
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиента.Форма.ФормаДокумента", ПараметрыФормы);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПланировщик()
	
	НачалоПериода = НачалоНедели(ТекущаяДатаСеанса());
	КонецПериода = КонецНедели(ТекущаяДатаСеанса());
	
	Планировщик.Элементы.Очистить();
	
	ОбслуживаниеКлиента = Документы.ВКМ_ОбслуживаниеКлиента.Выбрать(НачалоПериода, КонецПериода);
	
	Пока ОбслуживаниеКлиента.Следующий() Цикл
		
		ДатаРабот = Формат(ОбслуживаниеКлиента.ДатаПроведенияРабот, "ДФ=""ггггММдд""");
		ВремяНачало = Формат(ОбслуживаниеКлиента.ВремяНачалаРабот, "ДФ=""ЧЧммсс""");
		ВремяОкончания = Формат(ОбслуживаниеКлиента.ВремяОкончанияРабот, "ДФ=""ЧЧммсс""");
		
		НачалоРабот = Дата(ДатаРабот + ВремяНачало);
		ОкончаниеРабот = Дата(ДатаРабот + ВремяОкончания);
		
		ЭлементПланировщик = Планировщик.Элементы.Добавить(НачалоРабот, ОкончаниеРабот);
		ЭлементПланировщик.Значение = ОбслуживаниеКлиента.Ссылка;
		ЭлементПланировщик.Текст = ОбслуживаниеКлиента.Специалист;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
