#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	НачалоОтпуска = НачалоДня(ТекущиеДанные.ДатаНачала);
	КонецОтпуска = НачалоДня(ТекущиеДанные.ДатаОкончания);
	ДеньСек = 86400;
	
	Если Не ЗначениеЗаполнено(КонецОтпуска) Тогда
		ТекущиеДанные.КоличествоДней = 0;
	Иначе
		ТекущиеДанные.КоличествоДней = (КонецОтпуска - НачалоОтпуска + ДеньСек) / ДеньСек;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	НачалоОтпуска = НачалоДня(ТекущиеДанные.ДатаНачала);
	КонецОтпуска = НачалоДня(ТекущиеДанные.ДатаОкончания);
	ДеньСек = 86400;
	
	Если Не ЗначениеЗаполнено(НачалоОтпуска) Тогда
		ТекущиеДанные.КоличествоДней = 0;
	Иначе
		ТекущиеДанные.КоличествоДней = (КонецОтпуска - НачалоОтпуска + ДеньСек) / ДеньСек;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	АдресОтпусковВХранилище = ПоместитьОтпускВХранилище();
	ПараметрыПодбора = Новый Структура("АдресОтпусковДокумента", АдресОтпусковВХранилище);  
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыПодбора, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьОтпускВХранилище() 
	
	ОтобранныеОтпуска = Объект.ОтпускаСотрудников.Выгрузить();
	ОтобранныеОтпуска.ВыгрузитьКолонку("Сотрудник");
	ОтобранныеОтпуска.ВыгрузитьКолонку("ДатаНачала");
	ОтобранныеОтпуска.ВыгрузитьКолонку("ДатаОкончания");
	
	Возврат ПоместитьВоВременноеХранилище(ОтобранныеОтпуска, УникальныйИдентификатор);

КонецФункции

#КонецОбласти
