
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура СозданиеАктов(Период) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОбработкаЗаказовОбороты.Договор,
		|	ОбработкаЗаказовОбороты.Заказ,
		|	0 КАК ДокументСсылка
		|ПОМЕСТИТЬ ВТ_ИсходныеДанные
		|ИЗ
		|	РегистрНакопления.ОбработкаЗаказов.Обороты(&ДатаНачала, &ДатаОкончания,,) КАК ОбработкаЗаказовОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Договор,
		|	РеализацияТоваровУслуг.Основание,
		|	РеализацияТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	НЕ РеализацияТоваровУслуг.ПометкаУдаления
		|	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИсходныеДанные.Договор КАК Договор,
		|	ВТ_ИсходныеДанные.Заказ КАК Заказ,
		|	МАКСИМУМ(ВТ_ИсходныеДанные.ДокументСсылка) КАК ДокументСсылка
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИсходныеДанные.Договор,
		|	ВТ_ИсходныеДанные.Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Данные.Договор КАК Договор,
		|	ВТ_Данные.Заказ КАК Заказ,
		|	ВТ_Данные.ДокументСсылка КАК ДокументСсылка,
		|	ЗаказПокупателя.Организация КАК Организация,
		|	ЗаказПокупателя.Контрагент КАК Контрагент
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ПО ВТ_Данные.Заказ = ЗаказПокупателя.Ссылка";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", НачалоДня(Период.ДатаОкончания));

	РезультатЗапроса = Запрос.Выполнить();
		
	Выборка = РезультатЗапроса.Выбрать();
		
	//ВсегоДоговоров = Выборка.Количество();
	//ТекДоговор = 1;
	
	Пока Выборка.Следующий() Цикл
	
		Если Не ЗначениеЗаполнено(Выборка.ДокументСсылка) И ЗначениеЗаполнено(Выборка.Заказ) Тогда
			
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Дата = НачалоДня(Период.ДатаОкончания);
			НовыйДокумент.Договор = Выборка.Договор;
			НовыйДокумент.Контрагент = Выборка.Контрагент;
			НовыйДокумент.Организация = Выборка.Организация;
			НовыйДокумент.Основание = Выборка.Заказ;
			НовыйДокумент.Комментарий = "Создано автоматически";
			НовыйДокумент.ВыполнитьАвтозаполнение();
			НовыйДокумент.Записать();
			 
			ВыбранныйДокумент = НовыйДокумент.ПроверитьЗаполнение();
			
			Если ВыбранныйДокумент Тогда
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = НСтр("ru = 'Поля документа не заполнены.'");
				Сообщение.Сообщить();
				Возврат;
			КонецЕсли;
            			
		КонецЕсли;
			
		//ПроцентВыполнения = ТекДоговор/ВсегоДоговоров*100;
		//ПроцентВыполнения = Окр(ПроцентВыполнения, 0);
			 
		//ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения);	
		//ТекДоговор = ТекДоговор + 1;		

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
